Autodesk.Revit.DB.Structure.FabricSheetType.SetLayoutAsCustomPattern(System.Double,System.Double,System.Double,System.Double,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.FabricWireItem},System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.FabricWireItem})
Sets the minor and major layout patterns as Custom, while specifying the needed parameters for this pattern.
Remarks:
The following properties are not used for custom fabric sheet type:
- MajorDirectionWireType;
- MinorDirectionWireType;
- MajorSpacing;
- MinorSpacing.
minorStartOverhang:
The distance from the edge of the sheet to the first wire in the minor direction.
minorEndOverhang:
The distance from the last wire to the edge of the sheet in the minor direction.
majorStartOverhang:
The distance from the edge of the sheet to the first wire in the major direction.
majorEndOverhang:
The distance from the last wire to the edge of the sheet in the major direction.
minorFabricWireItems:
The fabric wire items in the minor direction.
majorFabricWireItems:
The fabric wire items in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for minorStartOverhang is not a number
-or-
The given value for minorEndOverhang is not a number
-or-
The given value for majorStartOverhang is not a number
-or-
The given value for majorEndOverhang is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for minorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for minorEndOverhang must be between 0 and 30000 feet.
-or-
The given value for majorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for majorEndOverhang must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2017